app/Models/AkunModel.php

    public function getData(){
        return $this->db->table('data_user')
        -> get()->getResultArray();
---
SELECT *
FROM `data_user`

    public function qty_akun(){
        return $this->db->table('data_user')->get()->getNumRows();
---
SELECT *
FROM `data_user`