app/Models/KeluarModel.php

SELECT *
FROM `data_barang_keluar`
INNER JOIN `data_stock` ON `data_stock`.`id_barang` = `data_barang_keluar`.`id_barang`
---
    public function getData(){
        return $this->db->table('data_barang_keluar')
        -> join('data_stock', 'data_stock.id_barang = data_barang_keluar.id_barang', 'inner')
        -> get()->getResultArray();

SELECT *
FROM `data_barang_keluar`
---
    public function filterRangeOfDate($tglMulai, $tglSelesai){
        $query = $this->db->table('data_barang_keluar');
        $query -> join('data_stock', 'data_stock.id_barang = data_barang_keluar.id_barang');
        $query->select('*');
        $query->where('tgl_keluar >=', $tglMulai) -> where('tgl_keluar <=', $tglSelesai);
        return $query->get()->getResultArray();

SELECT *
FROM `data_barang_keluar`
---
    public function filterDateKategori($tglMulai, $tglSelesai, $kategori){
        $query = $this->db->table('data_barang_keluar');
        $query -> join('data_stock', 'data_stock.id_barang = data_barang_keluar.id_barang');
        $query->select('*');
        $query->where('tgl_keluar >=', $tglMulai) -> where('tgl_keluar <=', $tglSelesai);
        $query->where('kategori', $kategori);
        return $query->get()->getResultArray();

SELECT *
FROM `data_barang_keluar`
---
    public function qty_keluar(){
        return $this->db->table('data_barang_keluar')->get()->getNumRows();