app/Models/MasukModel.php

SELECT *
FROM `data_barang_masuk`
JOIN `data_stock` ON `data_stock`.`id_barang` = `data_barang_masuk`.`id_barang`
JOIN `data_supplier` ON `data_supplier`.`id_supplier` = `data_barang_masuk`.`id_supplier`
---
    public function getData(){
        return $this->db->table('data_barang_masuk')
        -> join('data_stock', 'data_stock.id_barang = data_barang_masuk.id_barang')
        -> join('data_supplier', 'data_supplier.id_supplier = data_barang_masuk.id_supplier')
        -> get()->getResultArray();

SELECT *
FROM `data_barang_masuk`
---
    public function filterRangeOfDate($tglMulai, $tglSelesai){
        $query = $this->db->table('data_barang_masuk');
        $query -> join('data_stock', 'data_stock.id_barang = data_barang_masuk.id_barang');
        $query -> join('data_supplier', 'data_supplier.id_supplier = data_barang_masuk.id_supplier');
        $query->select('*');
        $query->where('tgl_masuk >=', $tglMulai) -> where('tgl_masuk <=', $tglSelesai);
        return $query->get()->getResultArray();

SELECT *
FROM `data_barang_masuk`
---
    public function qty_masuk(){
        return $this->db->table('data_barang_masuk')->get()->getNumRows();

SELECT *
FROM `data_barang_masuk`
---
    public function grandTotalPerDate($tglMulai, $tglSelesai){
        $query = $this->db->table('data_barang_masuk');
        $query -> join('data_stock', 'data_stock.id_barang = data_barang_masuk.id_barang');
        $query -> join('data_supplier', 'data_supplier.id_supplier = data_barang_masuk.id_supplier');
        $query->select('SUM(total_harga_masuk) AS grand_total');
        $query->where('tgl_masuk >=', $tglMulai) -> where('tgl_masuk <=', $tglSelesai);
        return $query->get()->getRow()->grand_total;