app/Models/ReturModel.php

    public function getData(){
        return $this->db->table('data_retur_barang')
        -> join('data_stock', 'data_stock.id_barang = data_retur_barang.id_barang')
        -> join('data_supplier', 'data_supplier.id_supplier = data_retur_barang.id_supplier')
        -> get()->getResultArray();
---
SELECT *
FROM `data_retur_barang`
JOIN `data_stock` ON `data_stock`.`id_barang` = `data_retur_barang`.`id_barang`
JOIN `data_supplier` ON `data_supplier`.`id_supplier` = `data_retur_barang`.`id_supplier`

    public function filterRangeOfDate($tglMulai, $tglSelesai){
        $query = $this->db->table('data_retur_barang');
        $query -> join('data_stock', 'data_stock.id_barang = data_retur_barang.id_barang');
        $query -> join('data_supplier', 'data_supplier.id_supplier = data_retur_barang.id_supplier');
        $query->select('*');
        $query->where('tgl_masuk >=', $tglMulai) -> where('tgl_masuk <=', $tglSelesai);
        return $query->get()->getResultArray();
---
SELECT *
FROM `data_retur_barang`

    public function filterDateKategoriSupplier($tglMulai, $tglSelesai, $kategori, $idSupplier){
        $query = $this->db->table('data_retur_barang');
        $query -> join('data_stock', 'data_stock.id_barang = data_retur_barang.id_barang');
        $query -> join('data_supplier', 'data_supplier.id_supplier = data_retur_barang.id_supplier');
        $query->select('*');
        $query->where('tgl_masuk >=', $tglMulai) -> where('tgl_masuk <=', $tglSelesai);
        $query->where('kategori', $kategori);
        $query->where('data_retur_barang.id_supplier', $idSupplier);
        return $query->get()->getResultArray();
---
SELECT *
FROM `data_retur_barang`

    public function qty_retur(){
        return $this->db->table('data_retur_barang')->get()->getNumRows();
---
SELECT *
FROM `data_retur_barang`