app/Models/StockModel.php

    public function getData(){
        return $this->db->table('data_stock')
        -> get()->getResultArray();
---
SELECT *
FROM `data_stock`

    public function updateData($data, $id){
        $query = $this->db->table('data_stock')->update($data, array('id_barang' => $id));
---
UPDATE `data_stock` SET `nama_barang` = 'Indomie Soto Ayam 1 Dus (40 pcs)', `kategori` = 'makanan_instan', `qty_stock` = '19', `harga_satuan` = '125000', `total_harga` = 2375000, `status` = 'tersedia'
WHERE `id_barang` = '9'

    public function filterCategory($kategori){
        $query = $this->db->table('data_stock');
        $query->select('*');
        $query->where('kategori', $kategori);
        return $query->get()->getResultArray();
---
SELECT *
FROM `data_stock`

    public function filterCategoryStatus($kategori, $status){
        $query = $this->db->table('data_stock');
        $query->select('*');
        $query->where('kategori', $kategori);
        $query->where('status', $status);
        return $query->get()->getResultArray();
---
SELECT *
FROM `data_stock`

    public function qty_stock(){
        return $this->db->table('data_stock')->get()->getNumRows();
---
SELECT *
FROM `data_stock`