app/Models/SupplierModel.php

    public function getData(){
        return $this->db->table('data_supplier')
        -> get()->getResultArray();
---
SELECT *
FROM `data_supplier`

    public function qty_supplier(){
        return $this->db->table('data_supplier')->get()->getNumRows();
---
SELECT *
FROM `data_supplier`